---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetRebarUpdateCurvesData
source: html/64b5059a-5cfe-bf9a-b13c-dea51ff40449.htm
---
# Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetRebarUpdateCurvesData Method

Gets a class that contains information used as input and output for rebar free form calculation.

## Syntax (C#)
```csharp
public RebarUpdateCurvesData GetRebarUpdateCurvesData()
```

## Returns
Gets a class that contains information used as input and output for rebar free form calculation.